tutorials/TJunction/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           outlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           outlet2

convertToMeters 1;

vertices
(
    (0.0  -0.04 0)   //0
    (0.2  -0.04 0)
    (0.2   0.04 0)   //2
    (0.0   0.04 0)

    (0.24 -0.04 0)  //4l
    (0.24  0.04 0)

    (0.2  -0.24 0)  //6
    (0.24 -0.24 0)

    (0.2   0.24 0)  //8
    (0.24  0.24 0)

    // Z
    (0.0  -0.04 0.04)   //0
    (0.2  -0.04 0.04)
    (0.2   0.04 0.04)   //2
    (0.0   0.04 0.04)

    (0.24 -0.04 0.04)  //4
    (0.24  0.04 0.04)

    (0.2  -0.24 0.04)  //6
    (0.24 -0.24 0.04)

    (0.2   0.24 0.04)  //8
    (0.24  0.24 0.04)

);

blocks
(
    // inlet block
    hex (0 1 2 3  10 11 12 13) (50 10 10) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (10 10 10) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (10 50 10) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (10 50 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 10 13 3)
        );
    }

    inlet_top
    {
        type patch;
        faces
        (
            (6 7 17 16)
        );
    }

    inlet_bottom
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }

    defaultFaces
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
