tutorials/TJunction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16000
(
(0.160064 9.34598e-12 -5.24573e-12)
(0.160064 8.10414e-12 -1.43998e-11)
(0.160064 1.23752e-11 -7.46548e-12)
(0.160064 1.20148e-11 -4.39516e-12)
(0.160064 1.24761e-11 -4.20783e-12)
(0.160064 1.45032e-11 -4.40754e-12)
(0.160064 1.7323e-11 -4.98013e-12)
(0.160064 2.15564e-11 -5.81855e-12)
...
)
;

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet_top
    {
        type            fixedValue;
        value           uniform (0 -1 0);
    }
    inlet_bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            noSlip;
    }
}


// ************************************************************************* //
